pajacobs-ghub/pic18f46q71-x2-timer/pic18f46q71-x2timer.c
// pic18f46q71-x2timer.c
// X2-timer-ng build-3 with the PIC18F46Q71
//
// PJ, 2024-07-11 Start with the command interpreter.
//     2024-07-13 Virtual registers and DACs plus ADC.
//     2024-07-14 Simple trigger implemented.
//     2024-07-15 Fixed delays implemented.
//     2024-07-16 Add third delay to simple trigger and implement TOF trigger.
//     2024-07-17 Refactor code for setting of latches.
//     2026-04-15 Add RA7 driving REMOTE_LEDa, fix EEPROM writing.
//
#define VERSION_STR "v0.12 PIC18F46Q71 X2-timer-ng build-3 2026-04-15"
//
// PIC18F46Q71 Configuration Bit Settings (generated in Memory View)
// CONFIG1
#pragma config FEXTOSC = OFF
#pragma config RSTOSC = HFINTOSC_64MHZ

// CONFIG2
#pragma config CLKOUTEN = OFF
#pragma config PR1WAY = OFF
#pragma config BBEN = OFF
#pragma config CSWEN = OFF
#pragma config FCMEN = OFF
#pragma config FCMENP = OFF
#pragma config FCMENS = OFF

// CONFIG3
#pragma config MCLRE = EXTMCLR
#pragma config PWRTS = PWRT_64
#pragma config MVECEN = OFF
#pragma config IVT1WAY = OFF
#pragma config LPBOREN = OFF
#pragma config BOREN = SBORDIS

// CONFIG4
#pragma config BORV = VBOR_1P9
#pragma config ZCD = OFF
#pragma config PPS1WAY = OFF
#pragma config STVREN = ON
#pragma config LVP = ON
#pragma config DEBUG = OFF
#pragma config XINST = OFF

// CONFIG5
#pragma config WDTCPS = WDTCPS_31
#pragma config WDTE = ON

// CONFIG6
#pragma config WDTCWS = WDTCWS_7
#pragma config WDTCCS = SC

// CONFIG7
// BBSIZE = No Setting

// CONFIG8
#pragma config SAFSZ = SAFSZ_NONE

// CONFIG9
#pragma config WRTB = OFF
#pragma config WRTC = OFF
#pragma config WRTD = OFF
#pragma config WRTSAF = OFF
#pragma config WRTAPP = OFF

// CONFIG10
#pragma config CPD = OFF

// CONFIG11
#pragma config CP = OFF

#include <xc.h>
#include "global_defs.h"
#include <stdint.h>
#include <stdlib.h>

#include "uart.h"
#include "eeprom.h"
#include <stdio.h>
#include <string.h>

#define LED_POWER LATEbits.LATE0
#define LED_ARMa LATEbits.LATE1
#define LED_ARMb LATEbits.LATE2
#define LED_REMOTE LATAbits.LATA7

#define OUT0a LATCbits.LATC2
#define OUT0b LATCbits.LATC3
#define OUT1a LATDbits.LATD0
#define OUT1b LATDbits.LATD1
#define OUT2a LATDbits.LATD2
#define OUT2b LATDbits.LATD3
#define OUT3a LATCbits.LATC4
#define OUT3b LATCbits.LATC5
#define OUT4a LATDbits.LATD4
#define OUT4b LATDbits.LATD5
#define OUT5a LATDbits.LATD6
#define OUT5b LATDbits.LATD7
#define OUT6a LATBbits.LATB2
#define OUT6b LATBbits.LATB3
#define OUT7a LATBbits.LATB4
#define OUT7b LATBbits.LATB5

// Parameters controlling the device are stored in virtual registers.
#define NUMREG 9
int16_t vregister[NUMREG]; // working copy in SRAM
#define REG_MODE 0
#define REG_LEVELa 1
#define REG_LEVELb 2
#define REG_VREF 3
#define REG_DELAY0 4
#define REG_DELAY1 5
#define REG_DELAY2 6
#define REG_NUMER 7
#define REG_DENOM 8
const char* hints[NUMREG] = { 
  "mode",
  "level-a",
  "level-b",
  "Vref",
  "delay-0",
  "delay-1",
  "delay-2",
  "numer",
  "denom"
}; 

void set_registers_to_original_values()
{
    vregister[REG_MODE] = 0;    // mode
    // 0=simple trigger from INa, 1=time-of-flight(TOF) trigger
    vregister[REG_LEVELa] = 5;  // trigger level INa as a 8-bit count, 0-255
    vregister[REG_LEVELb] = 5;  // trigger level INb as a 8-bit count, 0-255
    vregister[REG_VREF] = 3;    // Vref selection for DAC
    // 0=off, 1=1024mV, 2=2048mV, 3=4096mV
    vregister[REG_DELAY0] = 0;  // delay 0 as a 16-bit count
    vregister[REG_DELAY1] = 0;  // delay 1
    vregister[REG_DELAY2] = 0;  // delay 2
    vregister[REG_NUMER] = 17;  // scaling numerator (1-255); keep small
    vregister[REG_DENOM] = 4;   // scaling denominator (1-255)
    // Scaling of 17/4 = 4.25 matches the X2 geometry of yesteryear.
}

// EEPROM is used to hold the parameters when the power is off.
// Note little-endian layout.
__EEPROM_DATA(0,0, 5,0, 5,0, 3,0);
__EEPROM_DATA(0,0, 0,0, 0,0, 17,0);
__EEPROM_DATA(4,0, 0,0, 0,0, 0,0);

char save_registers_to_EEPROM()
// Note that, if there is a reported failure of any byte,
// the function returns early with a failure flag.
{
    uint8_t fail_flag = 0;
    for (uint16_t i=0; i < NUMREG; ++i) {
        if (DATAEE_WriteByte(2*i, (char)(vregister[i] & 0x00FF))) return 1;
        if (DATAEE_WriteByte((2*i)+1, (char)((vregister[i] >> 8) & 0x00FF))) return 1;
    }
    return 0; // Success, if we arrive here.
}

char restore_registers_from_EEPROM()
{
    for (uint16_t i=0; i < NUMREG; ++i) {
        vregister[i] = (DATAEE_ReadByte((2*i)+1) << 8) | DATAEE_ReadByte(2*i);
    }
    return 0; // Always successful.
}

void init_pins()
{
    // Outputs for LEDs and debugging
    LED_POWER = 0; TRISEbits.TRISE0 = 0; ANSELEbits.ANSELE0 = 0;
    LED_ARMa = 0; TRISEbits.TRISE1 = 0; ANSELEbits.ANSELE1 = 0;
    LED_ARMb = 0; TRISEbits.TRISE2 = 0; ANSELEbits.ANSELE2 = 0;
    LED_REMOTE = 0; TRISAbits.TRISA7 = 0; ANSELAbits.ANSELA7 = 0;
    // We have comparator input pins C1IN0-/RA0 and C2IN3-/RB1.
    TRISAbits.TRISA0 = 1;
    ANSELAbits.ANSELA0 = 1;
    TRISBbits.TRISB1 = 1;
    ANSELBbits.ANSELB1 = 1;
    // Digital output signals.
    // Set their default level low until a peripheral drives them.
    OUT0a = 0; TRISCbits.TRISC2 = 0; ANSELCbits.ANSELC2 = 0;
    OUT0b = 0; TRISCbits.TRISC3 = 0; ANSELCbits.ANSELC3 = 0;
    OUT1a = 0; TRISDbits.TRISD0 = 0; ANSELDbits.ANSELD0 = 0;
    OUT1b = 0; TRISDbits.TRISD1 = 0; ANSELDbits.ANSELD1 = 0;
    OUT2a = 0; TRISDbits.TRISD2 = 0; ANSELDbits.ANSELD2 = 0;
    OUT2b = 0; TRISDbits.TRISD3 = 0; ANSELDbits.ANSELD3 = 0;
    OUT3a = 0; TRISCbits.TRISC4 = 0; ANSELCbits.ANSELC4 = 0;
    OUT3b = 0; TRISCbits.TRISC5 = 0; ANSELCbits.ANSELC5 = 0;
    OUT4a = 0; TRISDbits.TRISD4 = 0; ANSELDbits.ANSELD4 = 0;
    OUT4b = 0; TRISDbits.TRISD5 = 0; ANSELDbits.ANSELD5 = 0;
    OUT5a = 0; TRISDbits.TRISD6 = 0; ANSELDbits.ANSELD6 = 0;
    OUT5b = 0; TRISDbits.TRISD7 = 0; ANSELDbits.ANSELD7 = 0;
    OUT6a = 0; TRISBbits.TRISB2 = 0; ANSELBbits.ANSELB2 = 0;
    OUT6b = 0; TRISBbits.TRISB3 = 0; ANSELBbits.ANSELB3 = 0;
    OUT7a = 0; TRISBbits.TRISB4 = 0; ANSELBbits.ANSELB4 = 0;
    OUT7b = 0; TRISBbits.TRISB5 = 0; ANSELBbits.ANSELB5 = 0;
}

void update_FVRs()
{
    // We want to both the ADC and the DAC references set the same.
    uint8_t vref = vregister[REG_VREF] & 0x03;
    FVRCONbits.ADFVR = vref;
    FVRCONbits.CDAFVR = vref;
    FVRCONbits.EN = 1;
    while (!FVRCONbits.RDY) { /* should be less than 25 microseconds */ }
    return;
}

