pajacobs-ghub/pic18f46q71-x2-timer/pic18f46q71-x2timer.c
void interpret_command(char* cmdStr)
// We intend that valid commands are answered quickly
// so that the supervisory PC can infer the absence of a node
// by the lack of a prompt response.
// A command that does not do what is expected should return a message
// that includes the word "error".
{
    char* token_ptr;
    const char* sep_tok = ", ";
    int nchar;
    uint8_t i, j;
    int16_t v;
    // nchar = printf("DEBUG: cmdStr=%s", cmdStr);
    switch (cmdStr[0]) {
        case 'v':
            nchar = snprintf(bufB, NBUFB, "%s\n", VERSION_STR);
            putstr(bufB);
            break;
        case 'n':
            nchar = snprintf(bufB, NBUFB, "%u ok\n", NUMREG);
            putstr(bufB);
            break;
        case 'p':
            nchar = snprintf(bufB, NBUFB, "Register values:\n");
            putstr(bufB);
            for (i=0; i < NUMREG; ++i) {
                nchar = snprintf(bufB, NBUFB, "reg[%d]=%d (%s)\n",
                        i, vregister[i], hints[i]);
                putstr(bufB);
            }
            putstr("ok\n");
            break;
        case 'r':
            // Report a register value.
            token_ptr = strtok(&cmdStr[1], sep_tok);
            if (token_ptr) {
                // Found some nonblank text, assume register number.
                i = (uint8_t) atoi(token_ptr);
                if (i < NUMREG) {
                    v = vregister[i];
                    nchar = snprintf(bufB, NBUFB, "%d (%s) ok\n", v, hints[i]);
                    putstr(bufB);
                } else {
                    putstr("fail\n");
                }
            } else {
                putstr("fail\n");
            }
            break;
        case 's':
            // Set a register value.
            token_ptr = strtok(&cmdStr[1], sep_tok);
            if (token_ptr) {
                // Found some nonblank text; assume register number.
                // printf("text:\"%s\"", token_ptr);
                i = (uint8_t) atoi(token_ptr);
                if (i < NUMREG) {
                    token_ptr = strtok(NULL, sep_tok);
                    if (token_ptr) {
                        // Assume text is value for register.
                        v = (int16_t) atoi(token_ptr);
                        vregister[i] = v;
                        nchar = snprintf(bufB, NBUFB, "reg[%u] %d (%s) ok\n", i, v, hints[i]);
                        puts(bufB);
                        if (i == 3) { update_FVRs(); }
                        if (i == 1 || i == 2) { update_DACs(); }
                    } else {
                        putstr("fail\n");
                    }
                } else {
                    putstr("fail\n");
                }
            } else {
                putstr("fail\n");
            }
            break;
        case 'R':
            if (restore_registers_from_EEPROM()) {
                putstr("fail\n");
            } else {
                putstr("ok\n");
            }
            break;
        case 'S':
            if (save_registers_to_EEPROM()) {
                putstr("fail\n");
            } else {
                putstr("ok\n");
            }
            break;
        case 'F':
            set_registers_to_original_values();
            putstr("ok\n");
            break;
        case 'a':
            arm_and_wait_for_event();
            break;
        case 'c':
            // Report an ADC value.
            token_ptr = strtok(&cmdStr[1], sep_tok);
            if (token_ptr) {
                // Found some nonblank text, assume channel number.
                i = (uint8_t) atoi(token_ptr);
                if (i == 0 || i == 9 || i == 57 || i == 58) {
                    v = (int16_t)ADC_read(i);
                    nchar = snprintf(bufB, NBUFB, "%d ok\n", v);
                    putstr(bufB);
                } else {
                    putstr("fail\n");
                }
            } else {
                putstr("fail\n");
            }
            break;
        case 'h':
        case '?':
            putstr("\nPIC18F46Q71-I/P X2-trigger+timer commands and registers\n");
            putstr("\n");
            putstr("Commands:\n");
            putstr(" h or ? print this help message\n");
            putstr(" v      report version of firmware\n");
            putstr(" n      report number of registers\n");
            putstr(" p      report register values\n");
            putstr(" r <i>  report value of register i\n");
            putstr(" s <i> <j>  set register i to value j\n");
            putstr(" R      restore register values from EEPROM\n");
            putstr(" S      save register values to EEPROM\n");
            putstr(" F      set register values to original values\n");
            putstr(" a      arm device and wait for event\n");
            // Get ADC Positive Input Channel Selections from Table 41-7 in the data sheet
            putstr(" c <i>  convert analogue channel i (12-bit result, 0-4095)\n");
            putstr("        i=57 DAC2_output (INa)\n");
            putstr("        i=58 DAC3_output (INb)\n");
            putstr("        i=0  RA0/C1IN0- (INa)\n");
            putstr("        i=9  RB1/C2IN3- (INb)\n");
            putstr("\n");
            putstr("Registers:\n");
            putstr(" 0  mode: 0= simple trigger from INa signal\n");
            putstr("          1= time-of-flight(TOF) trigger\n");
            putstr(" 1  trigger level for INa as an 8-bit count, 0-255\n");
            putstr(" 2  trigger level for INb as an 8-bit count, 0-255\n");
            putstr(" 3  Vref selection for DACs 0=off, 1=1024mV, 2=2048mV, 3=4096mV\n");
            putstr(" 4  delay 0 as 16-bit count (8 ticks per us)\n");
            putstr(" 5  delay 1 as 16-bit count (8 ticks per us)\n");
            putstr(" 6  delay 2 as 16-bit count (8 ticks per us)\n");
            putstr(" 7  numerator for scaling (1-255) keep small\n");
            putstr(" 8  denominator for scaling (1-255)\n");
            putstr("ok\n");
            break;
        default:
            nchar = snprintf(bufB, NBUFB, "Error, unknown command: '%c'\n", cmdStr[0]);
            putstr(bufB);
    }
} // end interpret_command()

int main(void)
{
    int m;
    int n;
    init_pins();
    uart1_init(115200);
    restore_registers_from_EEPROM();
    __delay_ms(10);
    update_FVRs();
    update_DACs();
    ADC_init();
    __delay_ms(10);
    // Flash LED twice at start-up to indicate that the MCU is ready.
    for (int8_t i=0; i < 2; ++i) {
        LED_POWER = 1;
        __delay_ms(250);
        LED_POWER = 0;
        __delay_ms(250);
    }
    // Wait until we are reasonably sure that the MCU has restarted
    // and then flush the incoming serial buffer.
    __delay_ms(100);
    uart1_flush_rx();
    // We will operate the MCU as a slave, waiting for commands
    // and only responding then.
    LED_POWER = 1;  // Indicate that we are running. 
    while (1) {
        // Characters are not echoed as they are typed.
        // Backspace deleting is allowed.
        // CR signals end of incoming command string.
        m = getstr(bufA, NBUFA);
        if (m > 0) {
            interpret_command(bufA);
        }
    }
    ADC_close();
    FVR_close();
    uart1_flush_rx();
    uart1_close();
    LED_POWER = 0;
    return 0; // Expect that the MCU will reset.
} // end main
